tutorials/lagrangian/reactingParcelFilmFoam/cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    sides
    {
        type            patch;
        nFaces          1320;
        startFace       62790;
    }
    frontAndBack
    {
        type            wall;
        nFaces          4000;
        startFace       64110;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            directMappedWall;
        nFaces          1100;
        startFace       68110;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets         
1100
(
(-1.110223025e-16 0 -5.551115123e-17)
(1.110223025e-16 0 5.551115123e-17)
(-2.220446049e-16 0 5.551115123e-17)
(-2.220446049e-16 0 -2.775557562e-17)
(-1.110223025e-16 0 2.775557562e-17)
(0 0 0)
(-1.110223025e-16 0 0)
(-2.220446049e-16 0 -5.551115123e-17)
(-1.110223025e-16 0 0)
(-1.110223025e-16 0 -5.551115123e-17)
(-1.110223025e-16 0 5.551115123e-17)
(1.110223025e-16 0 0)
(1.110223025e-16 0 -5.551115123e-17)
(0 0 -5.551115123e-17)
(0 0 -2.775557562e-17)
(1.110223025e-16 0 -1.387778781e-17)
(1.110223025e-16 0 0)
(1.110223025e-16 0 0)
(0 0 2.775557562e-17)
(0 0 -5.551115123e-17)
(1.110223025e-16 0 5.551115123e-17)
(0 0 -1.110223025e-16)
(-1.110223025e-16 0 -5.551115123e-17)
(-1.110223025e-16 0 5.551115123e-17)
(0 0 5.551115123e-17)
(0 0 -2.775557562e-17)
(-2.220446049e-16 0 2.775557562e-17)
(-1.110223025e-16 0 0)
(-1.110223025e-16 0 0)
(0 0 -5.551115123e-17)
(1.110223025e-16 0 0)
(-1.110223025e-16 0 -5.551115123e-17)
(-1.110223025e-16 0 5.551115123e-17)
(0 0 5.551115123e-17)
(0 0 5.551115123e-17)
(1.110223025e-16 0 -5.551115123e-17)
(1.110223025e-16 0 -2.775557562e-17)
(0 0 -1.387778781e-17)
(1.110223025e-16 0 0)
(0 0 0)
(1.110223025e-16 0 2.775557562e-17)
(1.110223025e-16 0 -5.551115123e-17)
(0 0 -5.551115123e-17)
(-1.110223025e-16 0 -1.110223025e-16)
(-1.110223025e-16 0 -5.551115123e-17)
(0 0 5.551115123e-17)
(-3.330669074e-16 0 5.551115123e-17)
(-2.220446049e-16 0 -2.775557562e-17)
(-1.110223025e-16 0 2.775557562e-17)
(-2.220446049e-16 0 0)
(-1.110223025e-16 0 0)
(-3.330669074e-16 0 -5.551115123e-17)
(2.220446049e-16 0 0)
(-1.110223025e-16 0 -5.551115123e-17)
(0 0 5.551115123e-17)
(0 0 -5.551115123e-17)
(-1.110223025e-16 0 5.551115123e-17)
(0 0 5.551115123e-17)
(0 0 5.551115123e-17)
(-1.110223025e-16 0 2.775557562e-17)
(0 0 0)
(-1.110223025e-16 0 -1.387778781e-17)
(0 0 -5.551115123e-17)
(2.220446049e-16 0 0)
(0 0 -5.551115123e-17)
(0 0 5.551115123e-17)
(-1.110223025e-16 0 0)
(0 0 -5.551115123e-17)
(0 0 -5.551115123e-17)
(1.110223025e-16 0 -2.775557562e-17)
(-1.110223025e-16 0 -1.387778781e-17)
(0 0 0)
(0 0 0)
(0 0 2.775557562e-17)
(3.330669074e-16 0 -5.551115123e-17)
(-1.110223025e-16 0 5.551115123e-17)
(-1.110223025e-16 0 -1.110223025e-16)
(-1.110223025e-16 0 -5.551115123e-17)
(0 0 5.551115123e-17)
(-3.330669074e-16 0 5.551115123e-17)
(-3.330669074e-16 0 -2.775557562e-17)
(-3.330669074e-16 0 2.775557562e-17)
(-1.110223025e-16 0 0)
(-1.110223025e-16 0 0)
(-3.330669074e-16 0 -5.551115123e-17)
(-1.110223025e-16 0 0)
(-1.110223025e-16 0 -5.551115123e-17)
(-1.110223025e-16 0 5.551115123e-17)
(0 0 5.551115123e-17)
(2.220446049e-16 0 5.551115123e-17)
(0 0 -5.551115123e-17)
(0 0 -2.775557562e-17)
(0 0 -1.387778781e-17)
(1.110223025e-16 0 0)
(0 0 0)
(0 0 2.775557562e-17)
(0 0 -5.551115123e-17)
(0 0 -5.551115123e-17)
...
)
;
    }
)

// ************************************************************************* //
